package com.company.alibaba;

/**
 * \* project: JavaStudy
 * \* package: com.company.alibaba
 * \* author: Willi Wei
 * \* date: 2020-07-27 19:22:13
 * \* description: 小强由一个n层的收藏柜，每一层上都摆满了收藏品，为了区分不同藏品的优劣，小强为藏品标注了权值，全职越高，代表藏品越珍贵
 *                  小强将准备m件藏品赠送给小明，他想表明他的诚意但又想不出挑出最好的那m个，因此他给自己制定了挑选规则
 *                  他在每次挑选时，只能选择某一层两端的物品，
 *                  现在他想请你帮他计算出在满足上述规则的前提下，他能获得的最大权值和
 *
 *                  第一行输入两个正整数n和m，表示收藏柜子的层数和挑选的次数
 *                  接下来n行，每行先输入一个数字x，表示这一层物品的个数，接下来输入x个正整数，表示每个物品的权重c
 *
 *
 *                  2 3， 层数和 挑选次数
 *                  2 3 2
 *                  4 1 4 1 5
 *
 *                  10
 *
 *                  5 -> 1 -> 4
 *                  5 -> 3 -> 2
 * \
 */
public class Solution2 {
    /**
     *
     * @param nums
     */
    public void fun(int[][] nums){

    }
}